<details ><summary>plan for terraform_eks 2025-12-15 22:30:11 (UTC)</summary>
          <details ><summary>Additional output for <b>kvlxj/bluejeay-lab#terraform_eks</b></summary>

```terraform


       _               _              
   ___| |__   ___  ___| | _______   __
  / __| '_ \ / _ \/ __| |/ / _ \ \ / /
 | (__| | | |  __/ (__|   < (_) \ V / 
  \___|_| |_|\___|\___|_|\_\___/ \_/  
                                      
By Prisma Cloud | version: 3.2.22 
Update available 3.2.22 -> 3.2.495
Run pip3 install -U checkov to update 


terraform scan results:

Passed checks: 1, Failed checks: 0, Skipped checks: 0

Check: CKV_AWS_41: "Ensure no hard coded AWS access key and secret key exists in provider"
	PASSED for resource: aws.default
	File: /providers.tf:1-6
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/secrets-policies/bc-aws-secrets-5

Project: main

 Name                                                                                  Monthly Qty  Unit                    Monthly Cost   
                                                                                                                                           
 module.eks.module.eks_managed_node_group["test"].aws_eks_node_group.this[0]                                                               
 └─ Instance usage (Linux/UNIX, spot, c7i.xlarge)                                            1,460  hours                        $101.91   
                                                                                                                                           
 module.eks.aws_eks_cluster.this[0]                                                                                                        
 └─ EKS cluster                                                                                730  hours                         $73.00   
                                                                                                                                           
 module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0]                                                            
 └─ Instance usage (Linux/UNIX, spot, t3.small)                                              1,460  hours                         $10.51   
                                                                                                                                           
 module.eks.module.kms.aws_kms_key.this[0]                                                                                                 
 ├─ Customer master key                                                                          1  months                         $1.00   
 ├─ Requests                                                                     Monthly cost depends on usage: $0.03 per 10k requests     
 ├─ ECC GenerateDataKeyPair requests                                             Monthly cost depends on usage: $0.10 per 10k requests     
 └─ RSA GenerateDataKeyPair requests                                             Monthly cost depends on usage: $0.10 per 10k requests     
                                                                                                                                           
 module.eks.aws_cloudwatch_log_group.this[0]                                                                                               
 ├─ Data ingested                                                                Monthly cost depends on usage: $0.60 per GB               
 ├─ Archival Storage                                                             Monthly cost depends on usage: $0.0315 per GB             
 └─ Insights queries data scanned                                                Monthly cost depends on usage: $0.0059 per GB             
                                                                                                                                           
 OVERALL TOTAL                                                                                                                  $186.42 

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

──────────────────────────────────
49 cloud resources were detected:
∙ 5 were estimated
∙ 43 were free
∙ 1 is not supported yet, rerun with --show-skipped to see details

┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━┓
┃ Project                                            ┃ Baseline cost ┃ Usage cost* ┃ Total cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━┫
┃ main                                               ┃          $186 ┃           - ┃       $186 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━┛

```
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # module.eks.aws_eks_addon.before_compute["vpc-cni"] will be updated in-place
  ~ resource "aws_eks_addon" "before_compute" {
      ~ addon_version               = "v1.20.5-eksbuild.1" -> "v1.21.0-eksbuild.4"
        id                          = "bluejeay-lab-eks:vpc-cni"
        tags                        = {}
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.eks_managed_node_group["test"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = "BOTTLEROCKET_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "bluejeay-lab-eks"
      + disk_size              = (known after apply)
      + force_update_version   = true
      + id                     = (known after apply)
      + instance_types         = [
          + "c7i.xlarge",
          + "c7i-flex.xlarge",
          + "c6i.xlarge",
          + "t3a.xlarge",
          + "c7i.2xlarge",
          + "c7i-flex.2xlarge",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "test-"
      + node_role_arn          = (known after apply)
      + region                 = "eu-west-3"
      + release_version        = "1.51.0-47438798"
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-04a35f5c44c3b2813",
        ]
      + tags                   = {
          + "Name" = "test"
        }
      + tags_all               = {
          + "Name"     = "test"
          + "app:env"  = "lab"
          + "app:name" = "bluejeay"
        }
      + version                = "1.34"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 2
        }

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.eks.module.eks_managed_node_group["test"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "test-eks-node-group-"
      + path                  = "/"
      + tags_all              = {
          + "app:env"  = "lab"
          + "app:name" = "bluejeay"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.module.eks_managed_node_group["test"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["test"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["test"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["test"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for test EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "test-"
      + region                 = "eu-west-3"
      + tags_all               = {
          + "app:env"  = "lab"
          + "app:name" = "bluejeay"
        }
      + update_default_version = true
      + vpc_security_group_ids = [
          + "sg-02e3c3790330dd64b",
        ]
        # (2 unchanged attributes hidden)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "test"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name" = "test"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name" = "test"
            }
        }
    }

  # module.eks.module.eks_managed_node_group["test"].module.user_data.null_resource.validate_cluster_service_cidr will be created
  + resource "null_resource" "validate_cluster_service_cidr" {
      + id = (known after apply)
    }

Plan: 7 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details ><summary>Terraform plan validation check (terraform_eks)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |                                                           RESOURCE                                                           |
|--------|------------------------------------------------------------------------------------------------------------------------------|
| add    | `module.eks.module.eks_managed_node_group["test"].aws_eks_node_group.this[0]`                                                |
|        | `module.eks.module.eks_managed_node_group["test"].aws_iam_role.this[0]`                                                      |
|        | `module.eks.module.eks_managed_node_group["test"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]` |
|        | `module.eks.module.eks_managed_node_group["test"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]`          |
|        | `module.eks.module.eks_managed_node_group["test"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]`               |
|        | `module.eks.module.eks_managed_node_group["test"].aws_launch_template.this[0]`                                               |
|        | `module.eks.module.eks_managed_node_group["test"].module.user_data.null_resource.validate_cluster_service_cidr`              |
| update | `module.eks.aws_eks_addon.before_compute["vpc-cni"]`                                                                         |

</details>


<details ><summary>Instructions</summary>
  
▶️ To apply these changes, run the following command:

```bash
digger apply -p terraform_eks
```

⏩ To apply all changes in this PR:
```bash
digger apply
```

🚮 To unlock all projects in this PR:
```bash
digger unlock
```

</details>

</details>